In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
trns = pd.DataFrame({"amount":[10,1000,200,500,500000,9,25,12000,35000]})
trns

   amount
0      10
1    1000
2     200
3     500
4  500000
5       9
6      25
7   12000
8   35000

In [7]:
pd.cut(trns.amount,[0,50,100,200,500,1000,10000,100000,1000000])

0              (0, 50]
1          (500, 1000]
2           (100, 200]
3           (200, 500]
4    (100000, 1000000]
5              (0, 50]
6              (0, 50]
7      (10000, 100000]
8      (10000, 100000]
Name: amount, dtype: category
Categories (8, interval[int64, right]): [(0, 50] < (50, 100] < (100, 200] < (200, 500] < (500, 1000] < (1000, 10000] < (10000, 100000] < (100000, 1000000]]

In [9]:
abd = pd.cut(trns.amount,[0,50,100,200,500,1000,10000,100000,1000000],
             labels=["label"+str(i) for i in range(1,9)])
abd

0    label1
1    label5
2    label3
3    label4
4    label8
5    label1
6    label1
7    label7
8    label7
Name: amount, dtype: category
Categories (8, object): ['label1' < 'label2' < 'label3' < 'label4' < 'label5' < 'label6' < 'label7' < 'label8']

In [11]:
abd.value_counts().sort_index()

label1    3
label2    0
label3    1
label4    1
label5    1
label6    0
label7    2
label8    1
Name: amount, dtype: int64

In [13]:
pd.qcut(trns.amount,[0, .25, .5, .75, 1.])

0          (8.999, 25.0]
1       (500.0, 12000.0]
2          (25.0, 500.0]
3          (25.0, 500.0]
4    (12000.0, 500000.0]
5          (8.999, 25.0]
6          (8.999, 25.0]
7       (500.0, 12000.0]
8    (12000.0, 500000.0]
Name: amount, dtype: category
Categories (4, interval[float64, right]): [(8.999, 25.0] < (25.0, 500.0] < (500.0, 12000.0] < (12000.0, 500000.0]]

In [15]:
pd.qcut(trns.amount,[0, .5, .75, 1.]).value_counts()

(8.999, 500.0]         5
(500.0, 12000.0]       2
(12000.0, 500000.0]    2
Name: amount, dtype: int64

In [16]:
s = pd.Series(["2022-09-01","2021-12-31"])
s

0    2022-09-01
1    2021-12-31
dtype: object

In [18]:
s1 = pd.to_datetime(s)
s1

0   2022-09-01
1   2021-12-31
dtype: datetime64[ns]

In [29]:
end = pd.to_datetime("2022-09-05")
start = pd.to_datetime("1992-06-30")
print(len(pd.date_range(start,end)))
print(len(pd.date_range(start,end, freq="H")))

11025
264577

In [31]:
start = pd.to_datetime("2022-09-04")
end = pd.to_datetime("2022-09-10")
print(len(pd.date_range(start,end)))
print(len(pd.date_range(start,end, freq="H")))

7
145

In [42]:
y = input()
code =f"""
x = 7
y = {y}  # complete code
print(x + y) 
#expected out 30
"""

exec(compile(code,"mulstring",'exec'))

23
30

In [43]:
pd.Series([1, 2, 3]).values

array([1, 2, 3], dtype=int64)

In [44]:
pd.Series([1, 2, 3]).array

<PandasArray>
[1, 2, 3]
Length: 3, dtype: int64

In [45]:
df

NameError: name 'df' is not defined

In [46]:
df = pd.DataFrame({"foo": range(5), "bar": range(5, 10)})  
df

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [47]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
df.columns

Index(['foo', 'bar'], dtype='object')

In [49]:
df.values

array([[0, 5],
       [1, 6],
       [2, 7],
       [3, 8],
       [4, 9]], dtype=int64)

In [50]:
df.dtypes

foo    int64
bar    int64
dtype: object

In [52]:
df['sid'] = list('abcde')
df

   foo  bar sid
0    0    5   a
1    1    6   b
2    2    7   c
3    3    8   d
4    4    9   e

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   foo     5 non-null      int64
 1   bar     5 non-null      int64
 2   sid     5 non-null      object
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [54]:
df.select_dtypes(int)

   foo  bar
0    0    5
1    1    6
2    2    7
3    3    8
4    4    9

In [55]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['foo', 'bar', 'sid'], dtype='object')]

In [56]:
df.size

15

In [57]:
df

   foo  bar sid
0    0    5   a
1    1    6   b
2    2    7   c
3    3    8   d
4    4    9   e

In [58]:
df[df.bar >= 7]

   foo  bar sid
2    2    7   c
3    3    8   d
4    4    9   e

In [62]:
df.query('bar >= 7 and sid == "c"')

   foo  bar sid
2    2    7   c